package lesson_13;

import java.util.Arrays;

public class Lesson13 {
    public static void main(String[] args) {

        System.out.println("============= Task 0 ============");
        /*
        Task 0:
        Написать метод swap, принимающий на вход массив целых чисел, и два индекса.
        Метод должен поменять местами значения, хранящихся в этих индексах
        {0, 1, 2, 3, 4, 5, 6} -> swap(arr, 1, 5} -> {0, 5, 2, 3, 4, 1, 6}

        Если индексы за пределами массива?

        Перегрузка метода для работы с массивами строк.
         */

        System.out.println("============= Task 1 ============");

        /*
        Task 1:
        Написать метод переводящие все маленькие буквы латинского алфавита в строке в верхний регистр.
        toUpperCase() использовать низзя.
         */

        System.out.println("============= Task 2 ============");
        /*
        Task 2:
        Написать метод, принимающий строку и один или два индекса (перегрузка).
        Метод должен возвращать подстроку начиная с первого индекса (включительно) и заканчивая вторым индексом (не включительно)
        Если индекс 1 - начиная с индекса и до конца строки.

        Функционал повторяет метод String.substring(), так что этот метод использовать не нужно.
        Оригинальный метод ломает программу, если введены не корректные индексы. Наш метод аварийно завершать программу не должен.
         */

    } // end main

    //Methods area
}
